# Pandas 연습

In [3]:
import pandas as pd

In [4]:
s1 = pd.Series([10,20,30,40,50])
s1

0    10
1    20
2    30
3    40
4    50
dtype: int64

In [5]:
s1.index
print(s1.index)

RangeIndex(start=0, stop=5, step=1)

In [6]:
s1.values

array([10, 20, 30, 40, 50], dtype=int64)

In [7]:
s2 = pd.Series(['a','b','c',1,2,3])
s2

0    a
1    b
2    c
3    1
4    2
5    3
dtype: object

In [8]:
import numpy as np

s3 = pd.Series([np.nan,10,30])
s3

0     NaN
1    10.0
2    30.0
dtype: float64

In [9]:
index_date=['2018-10-07','2018-10-08','2018-10-09','2018-10-10']
s4 = pd.Series([200,195,np.nan,205],index=index_date) #index
s4

2018-10-07    200.0
2018-10-08    195.0
2018-10-09      NaN
2018-10-10    205.0
dtype: float64

In [10]:
s5 = pd.Series({'kor':100, 'eng':95,'math':90}) #dict
s5

kor     100
eng      95
math     90
dtype: int64

### 날짜 자동생성: date_range

In [11]:
pd.date_range(start = '2019-01-01',end = '2019-01-07') #2019/01/01, 2019.01.01 다됨

DatetimeIndex(['2019-01-01', '2019-01-02', '2019-01-03', '2019-01-04',
               '2019-01-05', '2019-01-06', '2019-01-07'],
              dtype='datetime64[ns]', freq='D')

In [12]:
pd.date_range(start='2019.01.01',periods=7) #freq을 정해주지않으면 기본적으론 Day

DatetimeIndex(['2019-01-01', '2019-01-02', '2019-01-03', '2019-01-04',
               '2019-01-05', '2019-01-06', '2019-01-07'],
              dtype='datetime64[ns]', freq='D')

In [13]:
pd.date_range(start='2019.01.01',periods=7,freq='2D') #freq안에 들어가는건 책참고

DatetimeIndex(['2019-01-01', '2019-01-03', '2019-01-05', '2019-01-07',
               '2019-01-09', '2019-01-11', '2019-01-13'],
              dtype='datetime64[ns]', freq='2D')

In [14]:
index_date = pd.date_range(start='2019.03.01',periods=5,freq='D')
pd.Series([51,62,55,49,58],index=index_date) #일일 판매량 같은거 할 때 유용

2019-03-01    51
2019-03-02    62
2019-03-03    55
2019-03-04    49
2019-03-05    58
Freq: D, dtype: int64

### dataframe을 활용한 데이터생성 및 다루기

In [16]:
import numpy as np
import pandas as pd
data_list = np.array([[10,20,30],[40,50,60],[70,80,90]])
pd.DataFrame(data_list)

    0   1   2
0  10  20  30
1  40  50  60
2  70  80  90

In [17]:
data = np.array([[1,2,3],[4,5,6],[7,8,9],[10,11,12]])
index_date = pd.date_range('2019-09-01',periods=4)
columns_list = ['A','B','C']
pd.DataFrame(data,index=index_date,columns=columns_list)

             A   B   C
2019-09-01   1   2   3
2019-09-02   4   5   6
2019-09-03   7   8   9
2019-09-04  10  11  12

In [18]:
table_data = {'year': [2015,2016,2016,2017,2017],
             'nation':['kor','kor','usa','kor','usa'],
             'number':[200,250,450,300,500]}
table_data

{'year': [2015, 2016, 2016, 2017, 2017],
 'nation': ['kor', 'kor', 'usa', 'kor', 'usa'],
 'number': [200, 250, 450, 300, 500]}

In [19]:
pd.DataFrame(table_data)

   year nation  number
0  2015    kor     200
1  2016    kor     250
2  2016    usa     450
3  2017    kor     300
4  2017    usa     500

In [20]:
df = pd.DataFrame(table_data,columns=['year','nation','number'])
df

   year nation  number
0  2015    kor     200
1  2016    kor     250
2  2016    usa     450
3  2017    kor     300
4  2017    usa     500

In [21]:
df.index

RangeIndex(start=0, stop=5, step=1)

In [22]:
df.columns

Index(['year', 'nation', 'number'], dtype='object')

In [23]:
df.values

array([[2015, 'kor', 200],
       [2016, 'kor', 250],
       [2016, 'usa', 450],
       [2017, 'kor', 300],
       [2017, 'usa', 500]], dtype=object)

In [24]:
s1 = pd.Series([1,2,3,4,5])
s2 = pd.Series([10,20,30,40,50])
s1 + s2

0    11
1    22
2    33
3    44
4    55
dtype: int64

In [25]:
table_data1 = {'a':list(range(1,6,1)),
              'b':list(range(10,60,10)),
              'c':list(range(100,600,100))}
df1 = pd.DataFrame(table_data1)
df1

   a   b    c
0  1  10  100
1  2  20  200
2  3  30  300
3  4  40  400
4  5  50  500

In [26]:
table_data2 = {'a':list(range(6,9,1)),
              'b':list(range(60,90,10)),
              'c':list(range(600,900,100))}
df2 = pd.DataFrame(table_data2)
df2

   a   b    c
0  6  60  600
1  7  70  700
2  8  80  800

In [27]:
df1 +df2

      a      b       c
0   7.0   70.0   700.0
1   9.0   90.0   900.0
2  11.0  110.0  1100.0
3   NaN    NaN     NaN
4   NaN    NaN     NaN

In [28]:
table_data3 = {'spring':[256.5,264.3,215.9,223.2,312.8],
              'summer':[770.6,567.5,599.8,387.1,446.2],
              'autumn':[363.5,231.2,293.1,247.7,381.6],
              'winter':[139.3,59.9,76.9,109.1,108.1]}
index_num = list(range(2012,2017,1))
colname = ["spring","summer","autumn","winter"]
df3 = pd.DataFrame(table_data3,columns=colname,index=index_num)
df3

      spring  summer  autumn  winter
2012   256.5   770.6   363.5   139.3
2013   264.3   567.5   231.2    59.9
2014   215.9   599.8   293.1    76.9
2015   223.2   387.1   247.7   109.1
2016   312.8   446.2   381.6   108.1

In [29]:
df3.mean()

spring    254.54
summer    554.24
autumn    303.42
winter     98.66
dtype: float64

In [30]:
df3.std()

spring     38.628267
summer    148.888895
autumn     67.358496
winter     30.925523
dtype: float64

In [31]:
df3.mean(axis=1)

2012    382.475
2013    280.725
2014    296.425
2015    241.775
2016    312.175
dtype: float64

In [32]:
df3.describe()

           spring      summer      autumn      winter
count    5.000000    5.000000    5.000000    5.000000
mean   254.540000  554.240000  303.420000   98.660000
std     38.628267  148.888895   67.358496   30.925523
min    215.900000  387.100000  231.200000   59.900000
25%    223.200000  446.200000  247.700000   76.900000
50%    256.500000  567.500000  293.100000  108.100000
75%    264.300000  599.800000  363.500000  109.100000
max    312.800000  770.600000  381.600000  139.300000

In [33]:
ktx_data = {'first':[39060,39896,42005,42300,42012,49321,31234],
           'second':[12394,5242,34956,4592,12934,3342,1232],
           'third':[4442,1234,5644,3424,5345,3442,4345],
           'forth':[304,1245,1221,2112,452,2123,212],
           'fifth':[np.nan,np.nan,np.nan,np.nan,1234,5234,2145]}
col_list = ['first','second','third','forth','fifth']
index_list = list(range(2011,2018,1))


df_ktx = pd.DataFrame(ktx_data,index=index_list,columns=col_list)
df_ktx

      first  second  third  forth   fifth
2011  39060   12394   4442    304     NaN
2012  39896    5242   1234   1245     NaN
2013  42005   34956   5644   1221     NaN
2014  42300    4592   3424   2112     NaN
2015  42012   12934   5345    452  1234.0
2016  49321    3342   3442   2123  5234.0
2017  31234    1232   4345    212  2145.0

In [34]:
df_ktx.head()

      first  second  third  forth   fifth
2011  39060   12394   4442    304     NaN
2012  39896    5242   1234   1245     NaN
2013  42005   34956   5644   1221     NaN
2014  42300    4592   3424   2112     NaN
2015  42012   12934   5345    452  1234.0

In [35]:
df_ktx.tail()

      first  second  third  forth   fifth
2013  42005   34956   5644   1221     NaN
2014  42300    4592   3424   2112     NaN
2015  42012   12934   5345    452  1234.0
2016  49321    3342   3442   2123  5234.0
2017  31234    1232   4345    212  2145.0

In [36]:
df_ktx.head(3)

      first  second  third  forth  fifth
2011  39060   12394   4442    304    NaN
2012  39896    5242   1234   1245    NaN
2013  42005   34956   5644   1221    NaN

In [37]:
df_ktx[1:2]

      first  second  third  forth  fifth
2012  39896    5242   1234   1245    NaN

In [38]:
df_ktx.loc[2011]

first     39060.0
second    12394.0
third      4442.0
forth       304.0
fifth         NaN
Name: 2011, dtype: float64

In [39]:
df_ktx.loc[2013:2016]

      first  second  third  forth   fifth
2013  42005   34956   5644   1221     NaN
2014  42300    4592   3424   2112     NaN
2015  42012   12934   5345    452  1234.0
2016  49321    3342   3442   2123  5234.0

In [40]:
df_ktx['first']

2011    39060
2012    39896
2013    42005
2014    42300
2015    42012
2016    49321
2017    31234
Name: first, dtype: int64

In [41]:
df_ktx['first'][0:4]

2011    39060
2012    39896
2013    42005
2014    42300
Name: first, dtype: int64

In [42]:
df_ktx.T #전치행렬

           2011     2012     2013     2014     2015     2016     2017
first   39060.0  39896.0  42005.0  42300.0  42012.0  49321.0  31234.0
second  12394.0   5242.0  34956.0   4592.0  12934.0   3342.0   1232.0
third    4442.0   1234.0   5644.0   3424.0   5345.0   3442.0   4345.0
forth     304.0   1245.0   1221.0   2112.0    452.0   2123.0    212.0
fifth       NaN      NaN      NaN      NaN   1234.0   5234.0   2145.0

In [43]:
df1 = pd.DataFrame({'class1':[95,92,98,100],
                   'class2':[91,93,97,99]})
df1

   class1  class2
0      95      91
1      92      93
2      98      97
3     100      99

In [44]:
df2 = pd.DataFrame({'class1':[87,89],
                   'class2':[85,90]})
df2

   class1  class2
0      87      85
1      89      90

In [45]:
df1.append(df2) #행추가

   class1  class2
0      95      91
1      92      93
2      98      97
3     100      99
0      87      85
1      89      90

In [46]:
df1.append(df2,ignore_index=True)

   class1  class2
0      95      91
1      92      93
2      98      97
3     100      99
4      87      85
5      89      90

In [47]:
df3 = pd.DataFrame({'class1':[96,83]})
df2.append(df3,ignore_index=True)

   class1  class2
0      87    85.0
1      89    90.0
2      96     NaN
3      83     NaN

In [48]:
import pandas as pd
import numpy as np
df4 = pd.DataFrame({'class3':[93,91,95,98]})
df1.join(df4)  #열추가

   class1  class2  class3
0      95      91      93
1      92      93      91
2      98      97      95
3     100      99      98

In [49]:
df5 = pd.DataFrame({'class4':[82,92]})
df1.join(df5)

   class1  class2  class4
0      95      91    82.0
1      92      93    92.0
2      98      97     NaN
3     100      99     NaN

In [50]:
df_A_B = pd.DataFrame({'month':['Jan','Feb','Mar','Apr'],
                      'A':[100,150,200,130],
                      'B':[90,110,140,170]})
df_A_B

  month    A    B
0   Jan  100   90
1   Feb  150  110
2   Mar  200  140
3   Apr  130  170

In [52]:
df_C_D =  pd.DataFrame({'month':['Jan','Feb','Mar','Apr'],
                      'C':[112,141,203,134],
                      'D':[90,110,140,170]})
df_C_D

  month    C    D
0   Jan  112   90
1   Feb  141  110
2   Mar  203  140
3   Apr  134  170

In [53]:
df_A_B.merge(df_C_D) #데이터프레임 합치기

  month    A    B    C    D
0   Jan  100   90  112   90
1   Feb  150  110  141  110
2   Mar  200  140  203  140
3   Apr  130  170  134  170

In [54]:
df_left = pd.DataFrame({'key':['a','b','c'],
                       'left':[1,2,3]})
df_right = pd.DataFrame({'key':['a','b','d'],
                       'left':[4,5,6]})

df_left.merge(df_right,how='left',on='key')

  key  left_x  left_y
0   a       1     4.0
1   b       2     5.0
2   c       3     NaN

In [55]:
df_left.merge(df_right,how='right',on='key')

  key  left_x  left_y
0   a     1.0       4
1   b     2.0       5
2   d     NaN       6

In [56]:
df_left.merge(df_right,how='outer',on='key')

  key  left_x  left_y
0   a     1.0     4.0
1   b     2.0     5.0
2   c     3.0     NaN
3   d     NaN     6.0

In [57]:
df_left.merge(df_right,how='inner',on='key')

  key  left_x  left_y
0   a       1       4
1   b       2       5

### File Read & Write

In [58]:
%%writefile C:/Users/rim/Desktop/Python/practice/git/pp.csv #csv만들기
    연도,동해,남해,서해,전체
    1996,1234,1256,1234,5162
    1997,6712,5123,4151,1234
    1998,1234,1256,1234,5162
    1999,1245,6732,1262,6723
    2000,1245,7123,1256,7321

Writing C:/Users/rim/Desktop/Python/practice/git/pp.csv

In [59]:
pd.read_csv('C:/Users/rim/Desktop/Python/practice/git/pp.csv')

       연도    동해    남해    서해    전체
0    1996  1234  1256  1234  5162
1    1997  6712  5123  4151  1234
2    1998  1234  1256  1234  5162
3    1999  1245  6732  1262  6723
4    2000  1245  7123  1256  7321